/* При поомщи цикла возвести число n в степень в m 
   И вывести все степени до заданной 
    n = 2 
    m = 10 

    2
    4
    8
    16
    32
    64
    128
    256
    512
    1024
*/

/*
let x = 0;
while (x < 10) {
    console.log(x);
    x++;
}
//while = if но, while открывает цикл и этот цикл будет работать до тех пор, пока условие true
//соблюдается. if единождое условие, и при его соблюдении, выполняет один раз какой-то блок действий

if(открыта ли дверь) {
    console.log(открыть дверь);
}
else {
    console.log(ошибка);
}

//не подходит ключ к двери 
//всего 5 ключей

*/
/*
let x = 0;
if (x < 11){
    console.log(x);
    x++;
}
*/ 
 
 
 
 
 
 
 
 
 
 
 
 
 
 /* 

   При поомщи цикла возвести число n в степень в m 
   И вывести все степени до заданной 
    n = 2 
    m = 10 

    2
    4
    8
    16
    32
    64
    128
    256
    512
    1024

    */

   function showMessage() {
    let message = "hello its me"; 
    console.log ( message );
}
