console.log("привет мир!"); // Вывод работающего кода консоль
2 + 2 

/* 
Типы данных в JavaScript 
в ES5 - 6 типов данных 
5 - простых ( тривиальных)
1- сложный ( составной)

*/

/*
Number ( числовой тип данных)
8
0
-9 
3.45 
5.43.789 - ошибочка! это не число! 
6,4 - так нельзя! 

Операторы для чисел
+ сложение 
- вычитание 
* умножение 
/ деление 
% - отсаток от деления (4 % 3 => 1)
** - возведение в степень ( 2 ** 3 => 8 )
                           ( 4 ** 1/2 => 2 ) корень из двух

*/

// Есть 8 студентов
// Есть 15 яблок 
// Сколько целых яблок можно дать каждому студенту? 

let students; // объявление переменной 
let apples; 

// let students, apples; 
// ctrl+/ 

students =8;
apples =15;
let x;
x = apples / students;
console.log(x)




