/* 

 Логический тип данных
 Boolean 
       true - правда
       false - ложь 
*/
5>8 // true 
1 > 40 // false

let age =  999;
let ac
acceptAge = 12<

age < acceptAge // false 
12 <= 12
 

/* 

Операторы сравнения 
< - меньше 
> - больше 
<= - меньше или равно 
>= больше или равно 
== сравнение / сравнить равно 
!= - не равно
=== - строгое равеннство 
!== - строгое неравенство 

*/

let n = "10";
let num = 10;

console.log(n == num); // true
console.log(n + 2);    // "102"
console.log(n + 2);    // 12
console.log(num + 2);

console.log(n + 2 ==num + 2); // false

console.log(n ===num); // false 

/* 
динамическое сравнение - сравнить значание 
не зависимо от типа данных 

"10" == 10
10 == 10 
"10" == "10"

Строгое сравнение - сравнить типы данных, и если они совпадают 
- сравнить значения 
"10" === 10
*/

/* 
        Логические операторы  
      0 - false
      1 - true
       
      !  НЕ - логическое отрицание 
      || ИЛИ - логическое сложение 
      §§ И - логическое умножение 
       
      Я иду гулять
      На улице хорошая погода 
      У меня есть зонт
      || 0      1
      0  0      1
      1  1      1
      Правда выполняется только тогда когда все 
      условия верны , когда хотя бы одно 
      из условий верно (true)

      Я буду есть суп
      У меня есть суп 
      У меня есть ложка 
      §§    0     1 
      0     0     0
      1     0     1   
*/
!true //false 

